package Newcom.klass;
//Создать класс Fraction, который представляет собой простую математическую дробь.
//   Класс хранит 2 поля: numerator и denominator.
//   Создать 2 конструктора:
//   • Со всеми параметрами. Не забыть проверку знаменателя не равного нулю
//   • Без параметров, который устанавливает значения в 1.
//   Создать метод вывода на консоль дроби в виде например 1/2
//   Создать статический метод принимающий 2 объекта Fraction и складывающий дроби,
//   возвращая новый объект Fraction, хранящий результат
public class Fraction {

//    private int numerator;
//    private int denominator;
//    public Fraction(int numerator, int denominator){
//        this.numerator = numerator;
//        this.denominator=denominator;
//    }
//    public Fraction(){
//        numerator=1;
//        denominator=1;
//    }
//    public int getNumerator(){
//        return numerator;
//
//    }
//    public void setNumerator(int Numerator){
//        this.numerator=Numerator;
//    }
//    public int getDenominator(){
//        return denominator;
//    }
//    public void setDenominator(int denominator){
//        this.denominator=denominator;
//    }
//    public void getFraction(){
//        System.out.println(numerator + "/" + denominator);
//    }


}
